In [52]:
Problems Day 3

SyntaxError: unmatched ')' (3236359207.py, line 6)

In [55]:
import pandas as pd

In [ ]:
Problem 1: Sorting the DataFrame
Using the DataFrame below:

Name	Age	Gender	Marks	City
John	20	Male	88	New York
Alice	22	Female	92	Los Angeles
Bob	    19	Male	75	Chicago
Emma	21	Female	89	San Francisco
a) Sort the DataFrame by Marks in ascending order.
b) Sort it by Name in descending alphabetical order.

In [75]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)
vr["Marks"].sort_values()

2    75
0    88
3    89
1    92
Name: Marks, dtype: int64

In [76]:
vr.sort_values(by="Name",ascending=False)

    Name  Age  Gender  Marks          City
0   John   20    Male     88      New York
3   Emma   21  Female     89  San Fransico
2    Bob   12    Male     75       Chicago
1  Alice   22  Female     92   Los Angeles

In [ ]:
Problem 2: Grouping and Aggregation
If the Gender column exists, group the DataFrame by Gender and:
a) Find the average Marks for each gender.
b) Count the number of students in each gender group.

In [58]:
avg=vr.groupby('Gender')['Marks'].mean()
avg

Gender
Female    90.5
Male      81.5
Name: Marks, dtype: float64

In [59]:
vr.groupby('Gender')["Name"].count()

Gender
Female    2
Male      2
Name: Name, dtype: int64

In [ ]:
Problem 3: Deleting Rows
a) Delete the row where the Name is "Emma".
b) Reset the index afterward to maintain sequential numbering.

In [78]:
vr = vr.loc[vr['Name'] != 'Emma']
vr

    Name  Age  Gender  Marks         City
0   John   20    Male     88     New York
1  Alice   22  Female     92  Los Angeles
2    Bob   12    Male     75      Chicago

In [61]:
vr = vr.reset_index(drop=True)
vr

    Name  Age  Gender  Marks         City
0   John   20    Male     88     New York
1  Alice   22  Female     92  Los Angeles
2    Bob   12    Male     75      Chicago

In [ ]:
roblem 4: Working with Missing Data
Simulate a missing data scenario by making Marks for "Alice" as NaN.
a) Replace the missing value with the average of the Marks column.
b) Drop rows where any value is missing.

In [80]:
import numpy as np
vr.loc[vr["Name"]=="Alice","Marks"]=np.nan
vr

    Name  Age  Gender  Marks         City
0   John   20    Male   88.0     New York
1  Alice   22  Female    NaN  Los Angeles
2    Bob   12    Male   75.0      Chicago

In [84]:
vr.loc[vr["Name"]=="Alice","Marks"]=vr["Marks"].mean()
vr

    Name  Age  Gender  Marks         City
0   John   20    Male   88.0     New York
1  Alice   22  Female   81.5  Los Angeles
2    Bob   12    Male   75.0      Chicago

In [73]:
vr.loc[vr["Name"]=="Alice","Marks"]=np.nan # for just checking 
vr.dropna(inplace=True) #To drop rows with any missing values (i.e., NaN):
vr

   Name  Age Gender  Marks      City
0  John   20   Male   88.0  New York
2   Bob   12   Male   75.0   Chicago

In [ ]:
Bonus Question
Problem 5: Combined Filtering
Find and display rows where:

Marks >= 80
City is not "New York"

In [98]:
vr[(vr["Marks"]> 80 )&(vr["City"]!="New York")]

    Name  Age  Gender  Marks         City
1  Alice   22  Female   81.5  Los Angeles

    Name  Age  Gender  Marks         City
1  Alice   22  Female   81.5  Los Angeles
2    Bob   12    Male   75.0      Chicago